# Спросить человека размеры поля (х * у),
# получить их ОДНИМ вводом '7x8',
# "нарисовать" поле буковками о без использования цикла.

size = input('Какого размера поле ты хочешь?\n')
xy = size.split('x')
# ['7', '8']
x = int(xy[0])
y = int(xy[1])
# Перебрать несколько разделителей
# ДОПУСТИМО: x, y = xy
# ДОПУСТИМО: x, y = size.split('x')
top_and_bottom = 'O' * y + '\n'
# чтобы внутри было пусто, надо в серединных строках
# добавить в середину пробелов на 2 меньше, (по одному с каждой стороны),
# чем всего символов в строке
middle = ('O' + (' ' * (y - 1 - 1)) + 'O' + '\n') * (x - 1 - 1)
print(top_and_bottom + middle + top_and_bottom)

# TODO: исправить программу так, чтоб можно было задать ширину стенки
